#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.http.myip: Reading...
data.http.myip: Read complete after 0s [id=http://ipv4.icanhazip.com]
module.aks.data.azurerm_subscription.primary: Reading...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork]
module.aks.data.azurerm_kubernetes_cluster.credentials: Reading...
data.azurerm_kubernetes_cluster.credentials: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNWRhODZjNy00YjViLTQ0OGYtOGZkNC0wOGU5YzdhMjE3MmY7b2JqZWN0SWQ9OTkwNTNlMDgtODdiNi00NTg1LWI3N2QtZTlkMjA3MjU1MWViO3N1YnNjcmlwdGlvbklkPWRjZDg4ODU1LTcwZGYtNDlhMC05ZjE1LWE5MTk0MWJiYTAzNDt0ZW5hbnRJZD03ZjhjYWZjOC00MzE0LTQwNzAtOTc0NC1mZTAyZjkxYmNiMjE=]
module.aks.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034]
module.aks.azurerm_role_definition.aks_reader: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/providers/Microsoft.Authorization/roleDefinitions/1557f53b-9436-af98-25c6-5e4cf1740fa6|/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034]
module.keyvault.azurerm_key_vault.keyvalue: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.KeyVault/vaults/kv-polinetwork]
module.aks.azurerm_kubernetes_cluster.k8s: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork]
data.azurerm_key_vault_secret.prod_tutorapp_bot_token: Reading...
data.azurerm_key_vault_secret.amp_password: Reading...
data.azurerm_key_vault_secret.dev_db_user: Reading...
data.azurerm_key_vault_secret.dev_app_secret_token: Reading...
data.azurerm_key_vault_secret.dev_db_password: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_azure_clientid: Reading...
data.azurerm_key_vault_secret.prod_mod_db_user: Reading...
data.azurerm_kubernetes_cluster.credentials: Read complete after 2s [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork]
data.azurerm_key_vault_secret.prod_mat_token: Reading...
module.aks.data.azurerm_kubernetes_cluster.credentials: Read complete after 2s [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork]
data.azurerm_key_vault_secret.gh_runner_token: Reading...
data.azurerm_key_vault_secret.amp_password: Read complete after 1s [id=https://kv-polinetwork.vault.azure.net/secrets/mc-amp-password/df27e34288cd4e86b7a4e354299f8284]
data.azurerm_key_vault_secret.ca_tls_crt: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_bot_token: Read complete after 2s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-bot-token/3563563cae6f446b98483d48722501db]
data.azurerm_key_vault_secret.grafana_admin_password: Reading...
data.azurerm_key_vault_secret.prod_mod_bot_token: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_azure_clientid: Read complete after 3s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-azure-client-id/b0a960fdd9c44d69a7e822fdca6fd07b]
data.azurerm_key_vault_secret.prod_tutorapp_db_user: Reading...
data.azurerm_key_vault_secret.dev_app_secret_token: Read complete after 3s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-app-secret-token/e6c2f1ec337e490ab72f3449dcffde66]
data.azurerm_key_vault_secret.prod_mod_git_password: Reading...
data.azurerm_key_vault_secret.dev_db_password: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-password/d3136bf3111241c584924ad83e1bd5ff]
data.azurerm_key_vault_secret.argocd_client_id: Reading...
data.azurerm_key_vault_secret.dev_db_user: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-user/fd6f78a35a91432aa18556407be83644]
data.azurerm_key_vault_secret.prod_tutorapp_db_password: Reading...
data.azurerm_key_vault_secret.prod_mod_db_user: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-mod-db-user/75dc80fca95f46d3a05e820ecbefe406]
data.azurerm_key_vault_secret.admin_db_password: Reading...
data.azurerm_key_vault_secret.prod_mat_token: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-bot-mat-token/3303faadab4448e0a689eb431d0062dd]
data.azurerm_key_vault_secret.amp_license: Reading...
data.azurerm_key_vault_secret.gh_runner_token: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/gh-runner-token/21c669a60f364092b90e52db4ea46cab]
data.azurerm_key_vault_secret.dev_aule_bot_token: Reading...
data.azurerm_key_vault_secret.ca_tls_crt: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/ca-crt/a63381c2535d4084be76b27f2ad52555]
data.azurerm_key_vault_secret.prod_mat_db_password: Reading...
data.azurerm_key_vault_secret.grafana_admin_password: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/grafana-admin-password/1364827717fa4654ab8fc1446f83e2ac]
data.azurerm_key_vault_secret.ca_tls_key: Reading...
data.azurerm_key_vault_secret.prod_mod_bot_token: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-mod-bot-token/5aef155b159b492891f3b17948073324]
data.azurerm_key_vault_secret.argocd_client_secret: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_db_user: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-db-user/2bed20e87fca47ccb8d5b8da026100dc]
data.azurerm_key_vault_secret.dev_app_admin_db_password: Reading...
data.azurerm_key_vault_secret.prod_mod_git_password: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/bot-prod-git-ssh-key/1066b912ea5a4eea89ca189449406a3b]
data.azurerm_key_vault_secret.prod_tutorapp_auth_password: Reading...
data.azurerm_key_vault_secret.argocd_client_id: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/argocd-client-id/1b49dc14ae034595bf5c74e255ee8ddf]
data.azurerm_key_vault_secret.prod_mat_db_user: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_db_password: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-db-password/304461fe15c14567a422b210c374f276]
data.azurerm_key_vault_secret.prod_db_password: Reading...
data.azurerm_key_vault_secret.admin_db_password: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/admin-db-password/33d587ac42324bb6bda55b7db228da4b]
data.azurerm_key_vault_secret.dev_db_host: Reading...
data.azurerm_key_vault_secret.amp_license: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/mc-amp-license/5c3060f40a4c4d018dba5cf1b847702f]
data.azurerm_key_vault_secret.dev_mat_config_password: Reading...
data.azurerm_key_vault_secret.dev_aule_bot_token: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-aule-bot-token/1d4f0eaca834434b8162ae5022a65b45]
data.azurerm_key_vault_secret.dev_mod_bot_token: Reading...
data.azurerm_key_vault_secret.prod_mat_db_password: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-bot-mat-db-password/082663ce438f414aa85455703a5e3b6e]
data.azurerm_key_vault_secret.prod_tutorapp_azure_secret: Reading...
data.azurerm_key_vault_secret.ca_tls_key: Read complete after 7s [id=https://kv-polinetwork.vault.azure.net/secrets/ca-key/7a2b6efe49184e8e936a50377ccd88e2]
data.azurerm_key_vault_secret.prod_tutorapp_auth_user: Reading...
data.azurerm_key_vault_secret.argocd_client_secret: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/argocd-client-secret/e6fb112c796342e085dce42856257ed4]
data.azurerm_key_vault_secret.dev_app_admin_db_user: Reading...
data.azurerm_key_vault_secret.dev_app_admin_db_password: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-app-admin-db-password/fe5d5bdca3304795956e20322d61b0d8]
data.azurerm_key_vault_secret.prod_mod_git_email: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_auth_password: Read complete after 7s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-auth-password/a775d070ab32462e95e7a5bd4af837b7]
data.azurerm_key_vault_secret.prod_mat_db_user: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-mat-db-user/6d2afa56b3d14e15b5ffd41edfff74f4]
module.aks.azurerm_kubernetes_cluster_node_pool.systempool["0"]: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork/agentPools/userpool]
module.aks.kubernetes_cluster_role_binding.adminorg: Refreshing state... [id=admin-global]
data.azurerm_key_vault_secret.prod_db_password: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-db-password/5e8e79f481ce479a95c39578bf25c469]
module.aks.kubernetes_namespace.monitoring: Refreshing state... [id=monitor]
module.aks.kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
module.gh-runner.kubernetes_namespace.bot-namespace: Refreshing state... [id=gh-runner]
module.aks.helm_release.cert-manager-controller: Refreshing state... [id=jetstack]
data.azurerm_key_vault_secret.dev_db_host: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-host/6ddefea6cdb34afc8e9f38c1e5582cf1]
data.azurerm_key_vault_secret.dev_mat_config_password: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-mat-config-password/62e8dcca157841bbb6868f857b1fc3b1]
module.gh-runner.kubernetes_secret.bot_secret: Refreshing state... [id=gh-runner/runner-token]
module.aks.kubernetes_secret.internal-ca: Refreshing state... [id=default/internal-ca]
module.aks.helm_release.prometheus-stack: Refreshing state... [id=prometheus]
data.azurerm_key_vault_secret.dev_mod_bot_token: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-mod-bot-token/1b37830ceb1f4ef19d844d751bbbdcea]
data.azurerm_key_vault_secret.prod_tutorapp_azure_secret: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-azure-secret/19b7c3e7242147dab09a2042bbe82bb6]
data.azurerm_key_vault_secret.prod_tutorapp_auth_user: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-auth-user/73f59c9e9b6e4805991aa68b28d95520]
data.azurerm_key_vault_secret.dev_app_admin_db_user: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-app-admin-db-user/457ce3fd1acb4a79b821f8e5d880fd3e]
module.aks.kubernetes_manifest.cert-argo-dex: Refreshing state...
data.azurerm_key_vault_secret.prod_mod_git_email: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-mod-git-email/e2f4738b51b7428490527b529061db65]
module.aks.module.cert_manager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.aks.module.cert_manager.time_sleep.wait: Refreshing state... [id=2023-01-15T22:34:16Z]
module.aks.module.cert_manager.kubectl_manifest.cluster_issuer[0]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-prod-issuer]
module.argo-cd.helm_release.argo_cd: Refreshing state... [id=argo]
module.argo-cd.kubernetes_namespace.argocd: Refreshing state... [id=argocd]
module.argo-cd.kubernetes_manifest.cert-argo-dex: Refreshing state...
module.argo-cd.helm_release.argocd_apps: Refreshing state... [id=argocd-apps]
module.mariadb.kubernetes_secret.initdb: Refreshing state... [id=mariadb/initdb]
module.mariadb.kubernetes_role_binding.app_dev: Refreshing state... [id=mariadb/db-dev-bind]
module.mariadb.kubernetes_namespace.mariadb: Refreshing state... [id=mariadb]
module.mariadb.azurerm_managed_disk.storage: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.Compute/disks/md-polinetwork]
module.mariadb.kubernetes_role.db_dev: Refreshing state... [id=mariadb/DBDev]
module.mariadb.kubernetes_config_map.initdb: Refreshing state... [id=mariadb/scripts]
module.mariadb.kubernetes_service.mariadb_service: Refreshing state... [id=mariadb/mariadb]
module.mariadb.kubernetes_secret.mariadb_admin: Refreshing state... [id=mariadb/mariadb-secret]
module.mariadb.kubernetes_persistent_volume.storageaks: Refreshing state... [id=mariadb-persistent-volume]
module.mariadb.kubernetes_persistent_volume_claim.mariadb_storage: Refreshing state... [id=mariadb/mariadb-storage-claim]
module.aule_bot.random_uuid.volume: Refreshing state... [id=d0ce3460-d5f3-b76c-be8b-a2e21cf5388f]
module.aule_bot.kubernetes_namespace.bot-namespace: Refreshing state... [id=aulebot]
module.bot_mat_prod.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-mat]
module.aule_bot.kubernetes_secret.bot_secret: Refreshing state... [id=aulebot/bot-config-secret]
module.bot_mod_dev.random_uuid.volume: Refreshing state... [id=82d874fc-ddcf-7b10-d817-0a0a48e99713]
module.bot_mat_prod.random_uuid.volume: Refreshing state... [id=ff0f262a-01ef-62f6-af47-3a38a72bfdf1]
module.bot_mod_prod.random_uuid.volume: Refreshing state... [id=bdf6cceb-12b3-41c2-0c11-241080e928d0]
module.bot_mod_dev.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-dev]
module.bot_mod_prod.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-prod]
module.bot_mod_prod.kubernetes_secret.git_ssh_config[0]: Refreshing state... [id=bot-prod/ssh-config]
module.mc.kubernetes_namespace.namespace: Refreshing state... [id=mcserver]
module.bot_mod_prod.kubernetes_secret.bot_secret: Refreshing state... [id=bot-prod/bot-config-secret]
module.bot_mod_dev.kubernetes_secret.bot_secret: Refreshing state... [id=bot-dev/bot-config-secret]
module.mc.kubernetes_secret.secret: Refreshing state... [id=mcserver/mc-secret]
module.tutorapp.kubernetes_secret.tutorapp_secret: Refreshing state... [id=tutor-prod/tutorapp-config-secret]
module.app_dev.kubernetes_secret.app_secret: Refreshing state... [id=app-dev/app-secrets]
module.app_dev.kubernetes_role.app_dev: Refreshing state... [id=app-dev/AppDev]
module.mc.random_uuid.volume: Refreshing state... [id=74220e62-d579-d488-e879-3ab84a801cf9]
module.app_dev.kubernetes_role_binding.app_dev: Refreshing state... [id=app-dev/app-dev-bind]
module.bot_mat_prod.kubernetes_secret.bot_secret: Refreshing state... [id=bot-mat/bot-config-secret]
module.bot_mod_prod.kubernetes_secret.git_config[0]: Refreshing state... [id=bot-prod/git-config]
module.bot_mat_prod.azurerm_managed_disk.storage[0]: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.Compute/disks/md-polinetwork-ff0f262a-01ef-62f6-af47-3a38a72bfdf1]
module.mc.azurerm_managed_disk.storage[0]: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.Compute/disks/md-polinetwork-74220e62-d579-d488-e879-3ab84a801cf9]
module.bot_mat_prod.kubernetes_persistent_volume.storage[0]: Refreshing state... [id=ff0f262a-01ef-62f6-af47-3a38a72bfdf1-bot-pv]
module.mc.kubernetes_persistent_volume.storage[0]: Refreshing state... [id=74220e62-d579-d488-e879-3ab84a801cf9-mc-pv]
module.bot_mat_prod.kubernetes_persistent_volume_claim.storage_pvc[0]: Refreshing state... [id=bot-mat/bot-pvc]
module.mc.kubernetes_persistent_volume_claim.storage_pvc[0]: Refreshing state... [id=mcserver/mc-pvc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.k8s will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "k8s" {
      - http_application_routing_enabled    = true -> null
        id                                  = "/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork"
        name                                = "aks-polinetwork"
        tags                                = {
            "Environment" = "Development"
        }
        # (24 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.aks.helm_release.ingress-nginx will be created
  + resource "helm_release" "ingress-nginx" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = true
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "nginx-ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                controller:
                    enableCustomResources: true
                    enableCertManager: true
            EOT,
        ]
      + verify                     = false
      + version                    = "4.6.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.aks.helm_release.prometheus-stack will be updated in-place
  ~ resource "helm_release" "prometheus-stack" {
        id                         = "prometheus"
        name                       = "prometheus"
      ~ values                     = [
          - (sensitive value),
          - <<-EOT
                prometheus:
                  prometheusSpec:
                    scrapeInterval: 15s
                    evaluationInterval: 15s
                    additionalScrapeConfigs:
                      - job_name: polifemo
                        static_configs:
                          - targets:
                              - api.polinetwork.org
                        metrics_path: /staging/v1/metrics-text
                    # remoteWrite:
                    #   - url: null
                    #     basic_auth:
                    #       username: null
                    #       password: null
            EOT,
          + (sensitive value),
        ]
        # (27 unchanged attributes hidden)
    }

  # module.aks.kubernetes_namespace.argocd will be created
  + resource "kubernetes_namespace" "argocd" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.argo-cd.helm_release.argo_cd will be updated in-place
  ~ resource "helm_release" "argo_cd" {
        id                         = "argo"
        name                       = "argo"
      ~ values                     = [
          - (sensitive value),
          + (sensitive value),
        ]
        # (27 unchanged attributes hidden)
    }

  # module.mc.kubernetes_role.mc_dev will be created
  + resource "kubernetes_role" "mc_dev" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "group" = "MCDev"
            }
          + name             = "MCDev"
          + namespace        = "mcserver"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
            ]
        }
      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "pods/portforward",
            ]
          + verbs      = [
              + "create",
            ]
        }
    }

  # module.mc.kubernetes_role_binding.mc_dev will be created
  + resource "kubernetes_role_binding" "mc_dev" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "mc-dev-bind"
          + namespace        = "mcserver"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "MCDev"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "c5777fbb-cc2f-4a79-a9a0-455170b86803"
          + namespace = "default"
        }
    }

Plan: 4 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Eliaxie, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*